tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
tap "zkondor/dist"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Command-line tools for fly.io services
brew "flyctl"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@14"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Video calls designed for energy, ideas and action
cask "around"
# Calendar for professionals and teams
cask "cron"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Flip clock screensaver
cask "fliqlo"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Utility to toggle dark mode
cask "nightowl"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Used to access context-specific actions when text is selected
cask "popclip"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# Messaging app with a focus on speed and security
cask "telegram"
# Calling and messaging application focusing on security
cask "viber"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
