tap "dart-lang/dart"
tap "dracula/install"
tap "fluttergen/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "romkatv/powerlevel10k"
tap "zkondor/dist"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Isolated development environments using Docker
brew "docker-compose"
# Firebase command-line tools
brew "firebase-cli"
# Command-line tools for fly.io services
brew "flyctl"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Environment diagnostics for Kotlin Multiplatform Mobile app development
brew "kdoctor"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15", restart_service: true
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Lightweight BitTorrent client
brew "transmission-cli"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart", link: false
# A command-line tool for The Flutter code generator for your assets, fonts, colors, … — Get rid of all String-based APIs. by Dart.
brew "fluttergen/tap/fluttergen"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Video calls designed for energy, ideas and action
cask "around"
# Multi-track audio editor and recorder
cask "audacity"
# Online gaming platform
cask "battle-net"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Collaborative team software
cask "figma"
# Flip clock screensaver
cask "fliqlo"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Java IDE by JetBrains
cask "intellij-idea"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Menu bar browser
cask "menubarx"
# Utility to extend trackpad functionality
cask "middleclick"
# Online collaborative whiteboard platform
cask "miro"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# IDE for professional Python development
cask "pycharm"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Control your tools with a few keystrokes
cask "raycast"
# Email client
cask "readdle-spark"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do & task list manager
cask "ticktick"
# Open-source BitTorrent client
cask "transmission"
# Calling and messaging application focusing on security
cask "viber"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "github.vscode-github-actions"
vscode "usernamehw.remove-empty-lines"
vscode "vintharas.learn-vim"
vscode "vscjava.vscode-gradle"
