tap "anomalyco/tap"
tap "leoafarias/fvm"
tap "oven-sh/bun"
brew "ruby"
brew "cocoapods"
brew "colima", restart_service: :changed
brew "docker-compose"
brew "ffmpeg"
brew "node"
brew "firebase-cli"
brew "glances"
brew "go"
brew "gource"
brew "mole"
brew "opencode"
brew "openjdk@17"
brew "starship"
brew "tmux"
brew "uv"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "leoafarias/fvm/fvm"
brew "oven-sh/bun/bun"
cask "1password"
cask "android-platform-tools"
cask "audacity"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "clearvpn"
cask "crossover"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dolphin"
cask "es-de"
cask "figma"
cask "fliqlo"
cask "flycast"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "handy"
cask "iina"
cask "jetbrains-toolbox"
cask "keka"
cask "keyboardcleantool"
cask "lm-studio"
cask "mactex"
cask "middleclick"
cask "notion-calendar"
cask "obs"
cask "openshot-video-editor"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "spotify"
cask "steam"
cask "telegram"
cask "temurin@21"
cask "ticktick"
cask "transmission"
cask "viber"
cask "visual-studio-code"
cask "warp"
cask "whatsapp"
cask "zen"
cask "zoom"
vscode "github.copilot-chat"
